Revit 2024 API
DocumentPrintedEventArgs Class
 The event arguments used by the DocumentPrinted event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2010
Syntax
C#
public class DocumentPrintedEventArgs : RevitAPIPostDocEventArgs
Visual Basic
Public Class DocumentPrintedEventArgs _
	Inherits RevitAPIPostDocEventArgs
Visual C++
public ref class DocumentPrintedEventArgs : public RevitAPIPostDocEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.DocumentPrintedEventArgs
See Also
DocumentPrintedEventArgs Members
Autodesk.Revit.DB.Events Namespace